api-ponto/app/controllers/presenca/frequentador_controller.rb

    def create
      @type = "create"
      @digitais_hash = params[:digitaisHash]

      username = params[:username].to_s.strip
      user = User.ativos.find_by("lower(username) = ?", username.downcase)

      if username.blank?
---
SELECT 1 AS one FROM "users" WHERE LOWER("users"."username") = LOWER('danilo.araujo') AND "users"."id" != 5 LIMIT 1