api-ponto/app/controllers/presenca/ponto_de_presenca_controller.rb

    def show
      @codigo_ativacao = params[:codigoAtivacao]
      @codigo_unico_maquina = params[:codigoUnicoMaquina]
      @digitais_hash = params[:digitaisHash]
      @registros_hoje = TimeRecord.by_date(Time.zone.now).includes(:user).order(punched_at: :asc)
---
SELECT "time_records".* FROM "time_records" WHERE "time_records"."user_id" = $1 AND "time_records"."punched_at" BETWEEN $2 AND $3 ORDER BY "time_records"."punched_at" DESC, "time_records"."created_at" DESC LIMIT $4  [["user_id", 1], ["punched_at", "2026-07-23 00:00:00"], ["punched_at", "2026-07-23 23:59:59.999999"], ["LIMIT", 1]]