api-ponto/app/controllers/presenca/sincronizar_registros_ponto_controller.rb

INSERT INTO "users" ("id", "nome_completo", "username", "password_digest", "status", "digitais_hash", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "time_records".* FROM "time_records" WHERE "time_records"."user_id" = $1 AND "time_records"."punched_at" BETWEEN $2 AND $3 ORDER BY "time_records"."punched_at" DESC, "time_records"."created_at" DESC LIMIT $4  [["user_id", 1], ["punched_at", "2026-07-23 00:00:00"], ["punched_at", "2026-07-23 23:59:59.999999"], ["LIMIT", 1]]
SELECT 1 AS one FROM "time_records" WHERE "time_records"."punched_at" BETWEEN $1 AND $2 LIMIT $3  [["punched_at", "2025-01-01 00:00:00"], ["punched_at", "2025-01-01 23:59:59.999999"], ["LIMIT", 1]]
INSERT INTO "time_records" ("user_id", "raw_data", "punched_at", "authentication_mode", "created_at", "updated_at") VALUES (1, '1-15:07:2026:14:30:45', '2026-07-15 14:30:45', 'biometric', '2026-07-21 20:02:36.632476', '2026-07-21 20:02:36.632476') RETURNING "id"
---
    def create
      # Sprint 1 (Task 1.4): antes validava contra uma whitelist hardcoded de
      # códigos de ativação; agora valida contra estações reais cadastradas
      # em `EstacaoPonto` (mesma resposta/formato do protocolo, apenas a
      # fonte do dado mudou — ver ADR-0003).
      unless EstacaoPonto.codigo_ativacao_valido?(params[:codAtivacao])
        return render plain: "sincronizado"
      end

      registros_raw = params[:registros].to_s
      registros_decrypted = decrypt_registros(registros_raw)
      # A Estação junta os registros com ";" (ArquivoRegistros.lerArquivo,
      # não com quebra de linha — nunca houve "\n" nesse payload de verdade.
      linhas = registros_decrypted.split(";").map(&:strip).reject(&:empty?)

      registros_aceitos = []
      registros_rejeitados = []

      # B1 (Code Review Iteration 7): loop envolto em transação para garantir
      # que nenhum registro seja persistido parcialmente se uma linha falhar.
      # O `create!` dentro do loop levanta exceção em caso de erro, o que
      # aciona o rollback automático da transação.
      ApplicationRecord.transaction do
        linhas.each do |linha|
        # Campo `punch_type` explícito opcional (ADR-001, Seção 3), separado
        # por "-" ao final da linha, ex: "1-15:07:2026:14:30:45-entry".
        parts = linha.match(/\A(\d+)-(\d{2}:\d{2}:\d{4}:\d{2}:\d{2}:\d{2})(?:-(\w+))?\z/)
        unless parts
          registros_rejeitados << { linha: linha, erro: "Formato de linha inválido" }
          next
        end

        user_id = parts[1].to_i
        punched_at = Time.zone.strptime(parts[2], "%d:%m:%Y:%H:%M:%S")

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
        # digitais) já foi feito do lado da Estação/DynFrequentadoresEstacao
        # (Sprint 3/4) antes do envio — o `user_id` na linha É o resultado
        # desse matching. Aqui apenas garantimos o vínculo com um cadastro
        # válido (FK não nula); não reimplementamos o matching biométrico.
        user = User.find_by(id: user_id)

SELECT 1 AS one FROM "time_records" WHERE "time_records"."user_id" = 5 AND "time_records"."punched_at" = '2026-08-21 16:27:26' LIMIT 1
---
          next
        end

        if TimeRecord.where(user_id: user.id, punched_at: punched_at).exists?

INSERT INTO "time_records" ("user_id", "raw_data", "punched_at", "authentication_mode", "created_at", "updated_at", "punch_type", "punch_type_explicit") VALUES (5, '5-21:08:2026:13:27:26', '2026-08-21 16:27:26', 'biometric', '2026-08-21 16:27:26.424420', '2026-08-21 16:27:26.424420', 'entry', FALSE) RETURNING "id"
---
          end
        end

        record = TimeRecord.create!(
          user_id: user.id,
          raw_data: linha,
          punched_at: punched_at,
          authentication_mode: params[:authenticationMode] == "manual" ? "manual" : "biometric",
          punch_type: punch_type,
          # Sprint R (R.5): auditoria — true quando o valor veio do payload,
          # false quando foi inferido pelo PunchTypeService (fallback ADR-08).
          punch_type_explicit: punch_type_is_explicit
        )