api-ponto/app/controllers/presenca/sincronizar_registros_ponto_controller.rb

        # digitais) já foi feito do lado da Estação/DynFrequentadoresEstacao
        # (Sprint 3/4) antes do envio — o `user_id` na linha É o resultado
        # desse matching. Aqui apenas garantimos o vínculo com um cadastro
        # válido (FK não nula); não reimplementamos o matching biométrico.
        user = User.find_by(id: user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

          end
        end

        record = TimeRecord.create!(
          user_id: user.id,
          raw_data: linha,
          punched_at: punched_at,
          authentication_mode: params[:authenticationMode] == "manual" ? "manual" : "biometric",
          punch_type: punch_type,
          # Sprint R (R.5): auditoria — true quando o valor veio do payload,
          # false quando foi inferido pelo PunchTypeService (fallback ADR-08).
          punch_type_explicit: punch_type_is_explicit
        )
---
INSERT INTO "time_records" ("user_id", "raw_data", "punched_at", "authentication_mode", "created_at", "updated_at", "punch_type", "punch_type_explicit") VALUES (1, '1-23:07:2026:18:33:00', '2026-07-23 18:33:00', 'biometric', '2026-07-23 18:33:00.957317', '2026-07-23 18:33:00.957317', 'entry', FALSE) RETURNING "id"