api-ponto/app/controllers/presenca/sincronizar_registros_ponto_controller.rb

    def create
      unless params[:codAtivacao].present? && %w[poc-ativacao-001 SistemaOperacionalNaoSuportado].include?(params[:codAtivacao])
        return render plain: "sincronizado"
      end

      registros_raw = params[:registros].to_s
      registros_decrypted = decrypt_registros(registros_raw)
      linhas = registros_decrypted.split("\n").map(&:strip).reject(&:empty?)

      linhas.each do |linha|
        parts = linha.match(/\A(\d+)-(\d{2}:\d{2}:\d{4}:\d{2}:\d{2}:\d{2})\z/)
        next unless parts

        user_id = parts[1].to_i
        punched_at = DateTime.strptime(parts[2], "%d:%m:%Y:%H:%M:%S")
        next unless User.exists?(user_id)

        TimeRecord.create!(
          user_id: user_id,
          raw_data: linha,
          punched_at: punched_at,
          authentication_mode: "biometric"
        )
---
INSERT INTO "time_records" ("user_id", "raw_data", "punched_at", "authentication_mode", "created_at", "updated_at") VALUES (1, '1-15:07:2026:14:30:45', '2026-07-15 14:30:45', 'biometric', '2026-07-21 19:26:12.972565', '2026-07-21 19:26:12.972565') RETURNING "id"