api-ponto/app/controllers/presenca/validar_frequentador_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "admin.teste"], ["LIMIT", 1]]
---
    def show
      unless params[:codAtivacao].present? && %w[poc-ativacao-001 SistemaOperacionalNaoSuportado].include?(params[:codAtivacao])
        return render plain: "USUARIO_SENHA_INVALIDOS"
      end

      username = CryptoDes.decrypt(params[:loginAccessKey].to_s)
      password = CryptoDes.decrypt(params[:plainPassword].to_s)

      user = User.ativos.find_by(username: username)