api-ponto/app/models/time_record.rb

  def self.last_today(user_id)
    where(user_id: user_id, punched_at: Time.zone.now.beginning_of_day..Time.zone.now.end_of_day)
      .order(punched_at: :desc, created_at: :desc)
      .first
---
SELECT "time_records".* FROM "time_records" WHERE "time_records"."user_id" = 1 AND "time_records"."punched_at" BETWEEN '2026-07-23 00:00:00' AND '2026-07-23 23:59:59.999999' ORDER BY "time_records"."punched_at" DESC, "time_records"."created_at" DESC LIMIT 1