api-ponto/app/controllers/admin/dashboard_controller.rb

SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "time_records" WHERE (punched_at >= '2026-07-23 00:00:00')
SELECT COUNT(*) FROM "time_records" WHERE (punched_at >= '2026-07-16 18:00:59.812344')
SELECT COUNT(*) FROM "time_records" WHERE (punched_at >= '2026-06-23 18:00:59.817050')
SELECT "time_records".* FROM "time_records" WHERE "time_records"."punch_type" = 'entry' ORDER BY "time_records"."created_at" DESC LIMIT 5
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 2)
---
    def index
      @total_usuarios = User.count
      @usuarios_ativos = User.ativos.count
      @usuarios_inativos = @total_usuarios - @usuarios_ativos
      @usuarios_com_digitais = User.com_digitais.count

      hoje = Time.current.beginning_of_day
      @registros_hoje = TimeRecord.where("punched_at >= ?", hoje).count
      @registros_semana = TimeRecord.where("punched_at >= ?", 7.days.ago).count
      @registros_mes = TimeRecord.where("punched_at >= ?", 30.days.ago).count

      # "Últimas Batidas" exibe entradas e saídas em colunas separadas
      # (esquerda/direita) — buscamos os dois tipos independentemente para
      # que ambos os lados fiquem preenchidos mesmo se um tipo for muito
      # mais frequente que o outro no momento.
      @ultimas_entradas = TimeRecord.includes(:user)
                                     .where(punch_type: "entry")
                                     .order(created_at: :desc)
                                     .limit(5)