api-ponto/app/controllers/admin/time_records_controller.rb

SELECT "time_records".* FROM "time_records" WHERE "time_records"."user_id" = $1 AND "time_records"."punched_at" BETWEEN $2 AND $3 ORDER BY "time_records"."punched_at" DESC, "time_records"."created_at" DESC LIMIT $4  [["user_id", 1], ["punched_at", "2026-07-23 00:00:00"], ["punched_at", "2026-07-23 23:59:59.999999"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 2)
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 980190963], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = 5 LIMIT 1
SELECT "time_records".* FROM "time_records" WHERE (punched_at >= '2026-08-21 03:00:00') ORDER BY "time_records"."punched_at" ASC
SELECT "users".* FROM "users" WHERE "users"."id" = 5
SELECT COUNT(*) FROM "time_records" WHERE "time_records"."user_id" = 3
SELECT "users".* FROM "users" WHERE "users"."id" IN (2, 3, 4, 5)
SELECT COUNT(*) FROM "time_records" WHERE (punched_at >= '2026-08-21 03:00:00')
---
    def index
      @records = TimeRecord.includes(:user).order(punched_at: :desc)

      if params[:id].present?
        @records = @records.where(id: params[:id])
      end

      # Usuários não-admin (basic) veem apenas os próprios registros,
      # ignorando qualquer filtro de user_id vindo dos params.
      unless current_user.admin?
        @records = @records.where(user_id: current_user.id)
        @user = current_user
      elsif params[:user_id].present?
        @records = @records.where(user_id: params[:user_id])
        @user = User.find(params[:user_id])
      end

      if params[:start_date].present?
        parsed = Time.zone.parse(params[:start_date])
        @records = @records.where("punched_at >= ?", parsed.beginning_of_day) if parsed
      end

      if params[:end_date].present?
        parsed = Time.zone.parse(params[:end_date])
        @records = @records.where("punched_at <= ?", parsed.end_of_day) if parsed
      end

      @records = @records.limit(PER_PAGE)
      @total = @records.unscope(:limit, :order).count