api-ponto/app/controllers/admin/users_controller.rb

    def index
      @vinculos = Pessoas::Vinculo.frequentadores_ativos(
        nome: params[:nome],
        incluir_cpfs: cpfs_exigidos_pelos_filtros_locais,
        excluir_cpfs: cpfs_excluidos_pelos_filtros_locais.presence
      ).page(params[:page])

      # Pré-carrega todos os Users locais da página de uma vez (por cpf) em
      # vez de 1 query por linha na view.
      cpfs_da_pagina = @vinculos.filter_map { |vinculo| vinculo.pessoa&.cpf }
      @user_por_cpf = User.where(cpf: cpfs_da_pagina).index_by(&:cpf)

      # Users locais SEM cpf (ex: admins criados manualmente, sem vínculo
      # no pessoas2) não aparecem em `@vinculos` de jeito nenhum — listados
      # à parte pra não ficarem invisíveis/inacessíveis pela tela (decisão
      # do usuário, 2026-09-02).
      @users_sem_cpf = User.where(cpf: nil).order(:nome_completo)
      @users_sem_cpf = @users_sem_cpf.where("nome_completo ILIKE ?", "%#{params[:nome]}%") if params[:nome].present?
      @users_sem_cpf = @users_sem_cpf.where("username ILIKE ?", "%#{params[:username]}%") if params[:username].present?
      @users_sem_cpf = @users_sem_cpf.where(status: params[:status_filtro]) if params[:status_filtro].present?
---
SELECT 1 AS one FROM "users" WHERE LOWER("users"."username") = LOWER('usuario.teste') AND "users"."id" != 1 LIMIT 1