api-ponto/app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."nome_completo" ASC
---
    def index
      @users = User.order(:nome_completo)

INSERT INTO "users" ("nome_completo", "username", "password_digest", "status", "digitais_hash", "created_at", "updated_at", "admin") VALUES ('Danilo Araujo', 'danilo.araujo', '$2a$12$9itv37qrqJksWd40bxGFieq8eevlN.1TWyr5hRmQ29hP5743TyaAK', 1, NULL, '2026-08-21 16:27:10.911408', '2026-08-21 16:27:10.911408', FALSE) RETURNING "id"
---
    def create
      @user = User.new(user_params)
      if @user.save

UPDATE "users" SET "status" = 0, "updated_at" = '2026-07-23 20:24:13.822226' WHERE "users"."id" = 1
---
    def update
      if @user.cpf.present?
        redirect_to users_path, alert: "Frequentador vinculado ao Pessoas — edição manual bloqueada. O cadastro é atualizado via importação/reimportação do Pessoas."
        return
      end

      if @user.update(user_params)

UPDATE "users" SET "status" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["status", 0], ["updated_at", "2026-07-23 14:50:36.548313"], ["id", 980190970]]
---
    def destroy
      @user.update!(status: 0)

SELECT 1 AS one FROM "time_records" WHERE "time_records"."user_id" = 5 LIMIT 1
DELETE FROM "users" WHERE "users"."id" = 5
---
    def purge
      if @user.status == 1
        redirect_to users_path, alert: "Apenas usuários inativos podem ser excluídos"
      elsif @user.time_records.exists?
        redirect_to users_path, alert: "Não é possível excluir usuário com registros de ponto vinculados"
      else
        @user.destroy