api-ponto/app/controllers/dashboard_controller.rb

SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "time_records" WHERE (punched_at >= '2026-07-23 00:00:00')
SELECT COUNT(*) FROM "time_records" WHERE (punched_at >= '2026-07-16 12:23:44.743038')
SELECT COUNT(*) FROM "time_records" WHERE (punched_at >= '2026-06-23 12:23:44.746383')
SELECT "time_records".* FROM "time_records" ORDER BY "time_records"."created_at" DESC LIMIT $1  [["LIMIT", 10]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 2)
---
  def index
    @total_usuarios = User.count
    @usuarios_ativos = User.ativos.count
    @usuarios_inativos = @total_usuarios - @usuarios_ativos
    @usuarios_com_digitais = User.com_digitais.count

    hoje = Time.current.beginning_of_day
    @registros_hoje = TimeRecord.where("punched_at >= ?", hoje).count
    @registros_semana = TimeRecord.where("punched_at >= ?", 7.days.ago).count
    @registros_mes = TimeRecord.where("punched_at >= ?", 30.days.ago).count

    @ultimas_batidas = TimeRecord.includes(:user)
                                 .order(created_at: :desc)
                                 .limit(10)