api-ponto/app/controllers/time_records_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IN (2, 1)
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 90], ["LIMIT", 1]]
SELECT "time_records".* FROM "time_records" WHERE (punched_at >= $1) AND (punched_at <= $2) ORDER BY "time_records"."punched_at" DESC LIMIT $3  [[nil, "2026-07-22 00:00:00"], [nil, "2026-07-24 23:59:59.999999"], ["LIMIT", 50]]
SELECT COUNT(*) FROM "time_records" WHERE (punched_at >= $1) AND (punched_at <= $2)  [[nil, "2026-07-22 00:00:00"], [nil, "2026-07-24 23:59:59.999999"]]
SELECT COUNT(*) FROM "time_records"
---
  def index
    @records = TimeRecord.includes(:user).order(punched_at: :desc)

    if params[:user_id].present?
      @records = @records.where(user_id: params[:user_id])
      @user = User.find(params[:user_id])
    end

    if params[:start_date].present?
      @records = @records.where("punched_at >= ?", Time.zone.parse(params[:start_date]).beginning_of_day)
    end

    if params[:end_date].present?
      @records = @records.where("punched_at <= ?", Time.zone.parse(params[:end_date]).end_of_day)
    end

    @records = @records.limit(PER_PAGE)
    @total = @records.unscope(:limit, :order).count