api-ponto/app/controllers/users_controller.rb

  def index
    @users = User.order(:nome_completo)
---
SELECT "users".* FROM "users" ORDER BY "users"."nome_completo" ASC

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("nome_completo", "username", "password_digest", "status", "digitais_hash", "created_at", "updated_at") VALUES ('Francisca Maria Silva', 'francisca.silva', '$2a$12$R8SMvX/ivcYAsrfsrjn6H.lPvPMtF5fbjr/9eb995rHClMDTiDX6u', 1, NULL, '2026-07-23 13:39:31.550961', '2026-07-23 13:39:31.550961') RETURNING "id"

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "password_digest" = '$2a$12$0SAQl6TRYcz2JEiemBJrjO3146L7z3O6C8NaHdF5wQ9V.MWu9otei', "digitais_hash" = '', "updated_at" = '2026-07-23 12:54:04.601610' WHERE "users"."id" = 5

  def destroy
    @user.update!(status: 0)
---
UPDATE "users" SET "status" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["status", 0], ["updated_at", "2026-07-23 12:18:59.218341"], ["id", 30]]