api-ponto/app/views/time_records/index.html.erb

SELECT "users".* FROM "users" ORDER BY "users"."nome_completo" ASC
---
        <%= label_tag :user_id, "Usuário", class: "form-label" %>
        <%= select_tag :user_id, options_from_collection_for_select(User.order(:nome_completo), :id, :nome_completo, params[:user_id]), include_blank: "Todos", class: "form-select form-select-sm" %>